question=[
    [//問題ページ
        "P56 187",//0
        "P56 188",//1
        "P56 189",//2
        "P56 190",//3
        "P56 191",//4
        "P56 192",//5
        "P56 193",//6
        "P56 194",//7
        "P56 195",//8
        "P56 196",//9
        "P56 197",//10
        "P56 198",//11
        "P56 199",//12
        "P56 200",//13
        "P56 201",//14
        "P56 202",//15
        "P56 203",//16
        "P56 204",//17
        "P56 205",//18
        "P56 206",//19
        "P56 207",//20
        "P56 208",//21
        "P56 209",//22
        "P56 210",//23
        "P56 211",//24
        "P56 212",//25
        "P56 213",//26
        "P57 214",//27
        "P57 215",//28
        "P57 216",//29
        "P57 217",//30
        "P57 218",//31
        "P57 219",//32
        "P57 220",//33
        "P57 221",//34
        "P57 222",//35
        "P57 223",//36
        "P57 224",//37
        "P57 225",//38
        "P57 226",//39
        "P57 227",//40
        "P57 228",//41
        "P57 229",//42
        "P57 230",//43
        "P57 231",//44
        "P57 232",//45
        "P57 233",//46
        "P70 234",//47
        "P70 235",//48
        "P70 236",//49
        "P70 237",//50
        "P70 238",//51
        "P70 239",//52
        "P70 240",//53
        "P70 241",//54
        "P70 242",//55
        "P70 243",//56
        "P70 244",//57
        "P70 245",//58
        "P70 246",//59
        "P70 247",//60
        "P70 248",//61
        "P70 249",//62
        "P70 250",//63
        "P70 251",//64
        "P70 252",//65
        "P70 253",//66
        "P70 254",//67
        "P70 255",//68
        "P70 256",//69
        "P70 257",//70
        "P71 258",//71
        "P71 259",//72
        "P71 260",//73
        "P71 261",//74
        "P71 262",//75
        "P71 263",//76
        "P71 264",//77
        "P71 265"//78
    ],
    [//問題文
        "神経系を構成する細胞は何か。",
        "神経細胞は長い突起をもつ。この突起に沿って伝わる信号を何というか。",
        "脳や脊髄のような神経細胞が集まってできた神経系を何というか。",
        "中枢神経系と体の各部をつなぐ神経系を何というか。",
        "中枢神経系で、体の各部と脳を連絡している部位はどこか。",
        "中枢神経系で、視床と視床下部に区別される部位はどこか。",
        "間脳の一部で、自律神経系の中枢としてはたらく部位はどこか。",
        "中枢神経系で、呼吸運動、心臓の拍動を調節する部位はどこか。",
        "末梢神経系で、運動や感覚に関係した神経系は何か。",
        "末梢神経系で、内臓などを支配し、体内環境を調節する神経系は何か。",
        "自律神経系を構成する2つの神経は、何と何か。",
        "自律神経を構成する2つの神経のうち、脊髄の胸と腰の部分から出ている神経は何か。",
        "自律神経を構成する2つの神経のうち、中脳・延髄・脊髄の最下部から出ている神経は何か。",
        "器官や臓器の多くは交感神経と副交感神経の両方から制御されている。\nこの2つの神経が持つ互いに反対の作用を何というか。",
        "興奮状態にある時や、精神的、身体的に活動を活発にするときにはたらく自律神経は何か。",
        "食事や休息の時などにはたらく自律神経は何か。",
        "ホルモンを分泌する器官を何というか。",
        "内分泌腺から血液中に放出される物質で、低濃度でほかの器官や細胞に効果的に作用する物質を何というか。",
        "ホルモンを使って体内環境を調節するしくみを持った器官や組織の集まりを何というか。",
        "汗腺・乳腺・だ腺のように物質を対外に分泌する器官を何というか。",
        "外分泌腺には、物質を体外に分泌するための管が見られる。この器官を何というか。",
        "ホルモンが作用を及ぼす器官を何というか。",
        "標的器官には、特定のホルモンにだけ反応できる細胞がある。この細胞を何というか。",
        "標的細胞は特定のホルモンにだけ強く結合できるタンパク質を持つ。このタンパク質を何というか。",
        "神経細胞が分泌細胞に変化したもので、ホルモンにを分泌する細胞を何というか。",
        "脳下垂体は、前葉、中葉、後葉と呼ばれる部分に分けられる。ヒトでは発達していない部分は、この3つのうちどの部分か。",
        "視床下部にある神経分泌細胞から分泌されるホルモンで、脳下垂体前葉の細胞を刺激し、別のホルモンの放出を促すホルモンを何というか。",
        "成長ホルモンなど脳下垂体前葉から分泌されるホルモンを総称して何というか。",
        "視床下部にある神経分泌細胞から神経繊維を通して脳下垂体後葉まで直接運ばれ、血液中に分泌され腎臓の集合管に作用するホルモンは何か。",
        "甲状腺から分泌され、全身の代謝を高めるはたらきを持つホルモンを何というか。",
        "脳下垂体前葉ホルモンで、甲状腺からのホルモンの分泌を促進するホルモンは何か。",
        "最終的な分泌物の効果が、前の段階に戻って作用を及ぼすことを何というか。",
        "ヒトの血糖値はほぼ一定に保たれているが、グルコースは血液100mL中に約何mgの濃度にあるか。",
        "血糖値が血液100mL宙に200mgを超える高血糖になると、尿中にグルコースが排出されるような症状が見られる。このような病気を何というか。",
        "すい臓のランゲルハンス島のA細胞から分泌され、血糖値を上昇させるように作用するホルモンは何か。",
        "すい臓のランゲルハンス島のB細胞から分泌され、血糖値を低下させるように作用するホルモンは何か。",
        "副腎髄質から分泌され、血糖値を上昇させるように作用するホルモンは何か。",
        "副腎皮質から分泌され、タンパク質の分解を引き起こし、グルコースの合成を促進するホルモンは何か。",
        "グルカゴンやアドレナリンの作用により血糖値が上昇する。これは、肝臓で何が分解されてグルコースがつくられるためか。",
        "体温が低いときに、皮膚の血管、立毛筋を収縮させ放熱量を減少させる。\nこのとき、はたらく自律神経は何か。",
        "体温が高いときに、汗腺から汗の分泌が促進される。このとき、はたらく自律神経は何か。",
        "新生児に多数みられ、脂肪を盛んに分解することで体温の上昇に大きく貢献する組織は何か。",
        "褐色脂肪組織のはたらきを活性化する自律神経は何か。",
        "細胞外液の無機塩類の濃度、血液の送料の変化は、どこで完治されるか。",
        "脳下垂体後葉から分泌され、腎臓での水の再吸収を促進させるホルモンは何か。",
        "バソプレシンの作用により放出される尿の量はどうなるか。",
        "副腎皮質から分泌され、腎臓でのナトリウムイオンと水の再吸収を促進し、体内の無機塩類濃度を調節するホルモンは何か。",
        "有害な体外環境の変動や病原体などから体を守るしくみを総称して何というか。",
        "生体防御の中で、病原体などの体内への侵入を防いだり、侵入した病原体を排除したりするしくみを何というか。",
        "病原体の感染を防ぎ、感染した場合には病原体を認識してそれに応じて即座に生じる生体防御機構を何というか。",
        "特定のB細胞やT細胞によって病原体として認識された物質を何というか。",
        "脊椎動物に特殊化して発達した免疫で、抗原にのみ特異的に生じる強力な生体防御機構を何というか。",
        "適応免疫の1つで、T細胞が活性化して感染細胞を攻撃し、細胞内の病原体を除去する免疫を何というか。",
        "適応免疫の1つで、B細胞がつくる抗体によって病原体を排除する免疫を何というか。",
        "B細胞が活性化してつくる免疫グロブリンを何というか。",
        "白血球が病原体を細胞内に取り込んで処理するはたらきを何というか。",
        "好中球、マクロファージ、樹状細胞などの食作用を行う細胞を何というか",
        "B細胞、T細胞、NK細胞などの免疫細胞を何というか。",
        "白血球は、どこの、何という細胞から作られるか。",
        "骨髄でつくられたT細胞は、ある器官に移動して成熟する。この器官は何か。",
        "皮膚のバリアによる病原体の感染防御や、粘膜のける繊毛の運動による病原体の排除を何というか。",
        "粘液、汗などが弱酸性、胃液が強い酸性を示すことで、最近の増殖が抑えられる。この防御を何というか。",
        "だ液、粘液、汗などに含まれる、細胞の細胞壁を分解する酵素は何か。",
        "ディフェンシンは細菌の何を分解するか。",
        "血液から組織へ移動した単球から分化した細胞を何というか。",
        "病原体の侵入部が、マクロファージやマスト細胞のはたらきで赤く腫れる。この状態を何というか。",
        "白血球の約6割を占め、細胞内部に顆粒を持った細胞を何というか。",
        "好中球が死滅して膿を形成することを何というか。",
        "正常な細胞と感染細胞やがん細胞を細胞表面の違いで認識し、攻撃する細胞を何というか。",
        "自己の成分を抗原と認識するB細胞やT細胞が、成熟過程で排除されたり、免疫反応が生じないようになったりしている状態を何というか。",
        "病原体を取り込んだ樹状細胞は、病原体を断片化して細胞の表面に掲示する。樹状細胞のこのはたらきを何というか。",
        "活性化される前のT細胞には2種類が存在する。そのT細胞は担当する抗原情報を樹状細胞から提示されて活性化すると何になるか。2種類あげよ。",
        "増殖したT細胞の一部は、再度、同一の病原体が侵入した場合に備えて残る。この残ったT細胞を何というか。",
        "結核菌の細胞壁成分を注射することで、結核菌に対する記憶細胞の有無を調べる検査を何というか。",
        "B細胞から分泌される抗体をつくるタンパク質を何というか。",
        "抗原と抗体が結合する反応を何というか。",
        "活性化したB細胞は増殖して、抗体をつくる細胞に分化する。このB細胞が分化した細胞を何というか。",
        "初めて体内に侵入した病原体に対して起こる適応免疫の反応を何というか。",
        "2回目以降の体液性免疫で、一次応答より速く、強い免疫応答を何というか。"
    ],
    [//答え
        "神経細胞",
        "興奮",
        "中枢神経系",
        "末梢神経系",
        "脊髄",
        "間脳",
        "視床下部",
        "延髄",
        "体性神経系",
        "自律神経系",
        "交感神経\n副交感神経",
        "交感神経",
        "副交感神経",
        "拮抗的な作用",
        "交感神経",
        "副交感神経",
        "内分泌腺",
        "ホルモン",
        "内分泌系",
        "外分泌腺",
        "排出管",
        "標的器官",
        "標的細胞",
        "受容体",
        "神経分泌細胞",
        "中葉",
        "放出ホルモン",
        "脳下垂体前葉ホルモン",
        "バソプレシン",
        "チロキシン",
        "甲状腺刺激ホルモン",
        "フィードバック",
        "100mg",
        "糖尿病",
        "グルカゴン",
        "インスリン",
        "アドレナリン",
        "糖質コルチコイド",
        "グリコーゲン",
        "交感神経",
        "交感神経",
        "褐色脂肪組織",
        "交感神経",
        "間脳",
        "バソプレシン",
        "少なくなる。",
        "鉱質コルチコイド",
        "生体防御",
        "免疫",
        "自然免疫",
        "抗原",
        "適応免疫",
        "細胞性免疫",
        "体液性免疫",
        "抗体",
        "食作用",
        "食細胞",
        "リンパ球",
        "骨髄の造血幹細胞",
        "胸腺",
        "物理的な防御",
        "化学的な防御",
        "リゾチーム",
        "細胞膜",
        "マクロファージ",
        "炎症",
        "好中球",
        "化膿",
        "NK細胞(ナチュラルキラー細胞)",
        "免疫寛容",
        "抗原提示",
        "ヘルパーT細胞\nキラーT細胞",
        "記憶細胞",
        "ツベルクリン反応検査",
        "免疫グロブリン",
        "抗原抗体反応",
        "形質細胞",
        "一次応答",
        "二次応答"
    ]
];
var random;

function answer(){
    document.getElementById("answer").innerText = question[2][random];
}
function nextQ(){
    const ansDefault="答えがここに表示されます";
    document.getElementById("answer").innerText = ansDefault;

    random=myRandom(78,0);
    document.getElementById("questionPage").innerText = question[0][random];
    document.getElementById("question").innerText = question[1][random];
}
    
function myRandom(max, min) {
    return Math.floor(Math.random() * (max - min) + min);
}
