question = [
    ["P71 266", "じんましん、ぜんそく、くしゃみ、目のかゆみなどの症状が現れる無害な抗原に対する過敏な免疫反応を何というか。", "アレルギー"],
    ["P71 267", "アレルギーを引き起こす抗原を何というか。", "アレルゲン"],
    ["P71 268", "ハチ毒などによる急激な血圧低下や呼吸困難などの全身の強いショック症状を何というか。", "アナフィラキシーショック"],
    ["P71 269", "関節リウマチなどのように、事故反応性のB細胞やT細胞が自分自身の作る物質を抗原として認識し、免疫反応を引き起こす疾患を何というか。", "自己免疫疾患"],
    ["P71 270", "免疫の仕組みの一部、あるいは免疫にかかわる細胞がすべてなくなり、機能しなくなる疾患を何というか。", "免疫不全"],
    ["P71 271", "ヒト免疫不全ウイルス(HIV)が感染する、適応免疫に不可欠な免疫細胞は何か。", "ヘルパーT細胞"],
    ["P71 272", "HIVに感染することで、適応免疫が機能しなくなる疾患を何というか。", "後天性免疫不全症候群(AIDS)"],
    ["P71 273", "HIVに感染することで免疫の機能が低下し、通常では発病しない弱い病原体で発病することを何というか。", "日和見感染"],
    ["P71 274", "がん細胞を免疫によって監視することを何というか。", "がん免疫監視"],
    ["P71 275", "弱い一次応答を人工的に引き起こさせ、免疫記憶を作らせるために接種する死滅させた、あるいは弱毒化したウイルスや細菌を何というか。", "ワクチン"],
    ["P71 276", "インフルエンザや麻疹などの予防のために、少量のワクチンを体に注射して発病を防ぐことを何というか。", "予防接種"],
    ["P71 277", "血液から血球とフィブリンなどを取り除いたものを何というか。", "血清"],
    ["P71 278", "抗原を注射して人工的に抗体をつくらせた動物の血液を遠心分離して血球とフィブリンなどを取り除いた、抗体を多量に含む血清を何というか。", "抗血清"],
    ["P71 279", "マムシやハブなどの毒ヘビにかまれたときに、抗血清によって体内のヘビ毒を取り除く治療法を何というか。", "血清療法"],
    ["P71 280", "血清から免疫グロブリンだけを抽出精製した純度の高い製剤を何というか。", "免疫グロブリン製剤"],
    ["P84 281", "ある場所に生育する植物の集まりを何というか。", "植生"],
    ["P84 282", "よく発達した森林にみられる上下の層状の構造を何というか。", "階層構造"],
    ["P84 283", "岩石が風化してできた砂などに、落葉・落枝や生物の遺体が分解されてできた有機物が混じり合ったものを何というか。", "土壌"],
    ["P84 284", "落葉・落枝を分解する、ミミズ・ヤスデ・トビムシ・ダニなどの動物を何というか。", "土壌動物"],
    ["P84 285", "ある場所の植生が、時間とともに変化していく現象を何というか。", "遷移"],
    ["P84 286", "遷移のうち、土壌も形成されていない場所から始まるものを何というか。", "一次遷移"],
    ["P84 287", "遷移のうち、既に土壌が形成されており、土壌中に種子などが残っている場所で始まるものを何というか。", "二次遷移"],
    ["P84 288", "遷移の初期に現れる種を何というか。", "先駆種"],
    ["P84 289", "菌類に緑藻類あるいはシアノバクテリアが共生したものを何というか。", "地衣類"],
    ["P84 290", "明るい草原にまず侵入し、明るい環境で早く成長する樹木を何というか。", "陽樹"],
    ["P84 291", "地表に届く光が少なくなっても、芽生えが生育できる樹木を何というか。", "陰樹"],
    ["P84 292", "草原や耕地など、日当たりの良い環境でよく生育する植物を何というか。", "陽生植物"],
    ["P84 293", "林の中など、日陰の環境でも生育できる植物を何というか。", "陰生植物"],
    ["P84 294", "単位時間あたりのCO₂のコ丘陵であらわされる光合成の度合いを何というか。", "光合成速度"],
    ["P84 295", "単位時間あたりの植物のCO₂の放出量を何というか。", "呼吸速度"],
    ["P84 296", "光合成速度から呼吸速度を差し引いた二酸化炭素の吸収量を何というか。", "見かけの光合成速度"],
    ["P84 297", "適当な光の強さのもとで、光合成速度と呼吸速度がつり合い、見かけ上二酸化炭素を放出も吸収もしない状態のときの光の強さを何というか。", "光補償点"],
    ["P84 298", "光が十分な強さになると、それ以上光を強くしても光合成速度は光の強さに関係なく一定になる。この時の光の強さを何というか。", "光飽和点"],
    ["P84 299", "光飽和点の時の光合成速度を何というか。", "最大光合成速度"],
    ["P84 300", "遷移が進行した結果、それ以上は全体として大きな変化を示さない状態を何というか。", "極相(クライマックス)"],
    ["P84 301", "極相の状態で多く見られる種を何というか。", "極相種"],
    ["P84 302", "台風や寿命で木が倒れるなど、森林が部分的に破壊され、林内に光が差し込むようになる場所を何というか。", "ギャップ"],
    ["P84 303", "ある場所の植生が時間とともに次第に変化していく現象が、湖沼で起こる場合を何というか。", "湿性遷移"],
    ["P84 304", "ある場所の植生が時間とともに次第に変化していく現象が、陸地で起こる場合を何というか。", "乾性遷移"],
    ["P84 305", "植生を構成する植物とそこに生息する動物や微生物を含むすべての生物の集まりを何というか。", "バイオーム(生物群系)"],
    ["P84 306", "森林や草原など、外から見てわかる植生のようすを何というか。", "相観"],
    ["P84 307", "植生を構成する植物のうち、量的な割合が高い種を何というか。", "優占種"],
    ["P84 308", "植物の生活様式を反映した形態を何というか。", "生活形"],
    ["P85 309", "環境の厳しい季節に地表からどの高さに休眠芽をつけるか、あるいは種子として過ごすかによって区分した生活形を何というか。", "ラウンケルの生活形"],
    ["P85 310", "世界のバイオームを大きく3つに大別するとき、年降水量が多く、年平均気温が極端に低くない地域では、どんなバイオームが発達するか。", "森林"],
    ["P85 311", "世界のバイオームを大きく3つに大別するとき、樹木は生育できないくらいの年降水量の少ない地域では、どんなバイオームが発達するか。", "草原"],
    ["P85 312", "世界のバイオームを大きく3つに大別するとき、年平均気温が極端に低かったり、年降水量が極端に少なかったりする地域では、どんなバイオームが発達するか。", "荒原"],
    ["P85 313", "森林のうち、赤道に近い高温多雨の地域では、どんなバイオームが発達するか。", "熱帯多雨林"],
    ["P85 314", "森林のうち、熱帯より高緯度にあって、やや気温の低い時期のある地域では、どんなバイオームが発達するか。", "亜熱帯多雨林"],
    ["P85 315", "森林のうち、熱帯・亜熱帯でも雨季と乾季とがはっきりしている地域では、どんなバイオームが発達するか。", "雨緑樹林"],
    ["P85 316", "森林のうち、亜熱帯より高緯度で冬が比較的温暖な暖温帯では、どんなバイオームが発達するか。", "照葉樹林"],
    ["P85 317", "森林のうち、冬に雨が多く夏に雨が少ない地中海性気候の地域には、どんなバイオームが発達するか。", "硬葉樹林"],
    ["P85 318", "森林のうち、冬の寒さが厳しい冷温帯ではどんなバイオームが発達するか。", "夏緑樹林"],
    ["P85 319", "森林のうち、亜寒帯の地域では、どんなバイオームが発達するか。", "針葉樹林"],
    ["P85 320", "草原のうち、熱帯・亜熱帯で、雨緑樹林よりも降水量が少なく、樹木がまばらにしか生育できない地域には、どんなバイオームが発達するか。", "サバンナ"],
    ["P85 321", "草原のうち、温帯地域で、冬の寒さが厳しく、降水量が少ないために樹木が生育できない大陸の内陸部には、どんなバイオームが発達するか。", "ステップ"],
    ["P85 322", "荒原のうち、熱帯のサバンナや温帯のステップより降水量がさらに少ない地域には、どんなバイオームが発達するか。", "砂漠"],
    ["P85 323", "荒原のうち、亜寒帯より、高緯度の寒帯の地域には、どんなバイオームが発達するか。", "ツンドラ"]
];
var random;
var prev = null;

function answer() {
    document.getElementById("answer").innerText = question[random][2];
}

function nextQ() {
    const ansDefault = "答えがここに表示されます";
    document.getElementById("answer").innerText = ansDefault;
    do {
        random = myRandom(58, 0);
    } while (random == prev); //連続して同じ問題がでないように
    prev = random;
    document.getElementById("questionPage").innerText = question[random][0];
    document.getElementById("question").innerText = question[random][1];
}

function myRandom(max, min) {
    return Math.floor(Math.random() * (max - min) + min);
}
